## Lesson 2 – DataFrame Operations & Cleaning
Step 1 – Sorting Data

You can sort by column values or by index.

In [4]:
import pandas as pd
import numpy as np 

print("Pandas version:", pd.__version__)

# Load file
df = pd.read_csv("data/employees.csv")
df

Pandas version: 2.3.3

     Name  Age    City  Salary     Tax  Net Salary
0  Piyush   26  Bhopal   55000  5500.0     49500.0
1    Amit   25   Delhi   60000  6000.0     54000.0
2   Sneha   27    Pune   65000  6500.0     58500.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0

In [5]:
# Sort by single column

df.sort_values(by='Age', ascending=True)

     Name  Age    City  Salary     Tax  Net Salary
3    Ravi   24  Mumbai   62000  6200.0     55800.0
1    Amit   25   Delhi   60000  6000.0     54000.0
0  Piyush   26  Bhopal   55000  5500.0     49500.0
2   Sneha   27    Pune   65000  6500.0     58500.0

In [7]:
df.sort_values(by='Tax', ascending=False)

     Name  Age    City  Salary     Tax  Net Salary
2   Sneha   27    Pune   65000  6500.0     58500.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0
1    Amit   25   Delhi   60000  6000.0     54000.0
0  Piyush   26  Bhopal   55000  5500.0     49500.0

In [8]:
# Sort by multiple columns
df.sort_values(by=['City', 'Age'], ascending=[True, False])

     Name  Age    City  Salary     Tax  Net Salary
0  Piyush   26  Bhopal   55000  5500.0     49500.0
1    Amit   25   Delhi   60000  6000.0     54000.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0
2   Sneha   27    Pune   65000  6500.0     58500.0

In [10]:
# Sort by index
df.sort_index()

     Name  Age    City  Salary     Tax  Net Salary
0  Piyush   26  Bhopal   55000  5500.0     49500.0
1    Amit   25   Delhi   60000  6000.0     54000.0
2   Sneha   27    Pune   65000  6500.0     58500.0
3    Ravi   24  Mumbai   62000  6200.0     55800.0

Mini Task:
Sort your df by Salary (descending) and show only Name, Salary, and Net Salary columns.

In [13]:
df.sort_values(by=['Salary'], ascending=False)[['Name', 'Salary', 'Net Salary']]

     Name  Salary  Net Salary
2   Sneha   65000     58500.0
3    Ravi   62000     55800.0
1    Amit   60000     54000.0
0  Piyush   55000     49500.0

Step 2 – Renaming Columns

You’ll often need to rename messy column names.